const mood = prompt("Який у вас сьогодні настрій? (веселий, сумний, спокійний, енергійний)");

switch (mood) {
    case "Веселий":
        alert("Спробуйте пограти з друзями в настільну гру!");
        break;
        case "Сумний":
            alert("Вам може допомогти перегляд улюбленого фільму чи прогулянка");
            break;
            case "Спокійний":
            alert( "Чому б не почитати книгу або послухати музику?");
            break;
            case "Енергійний":
                alert("Займіться спортом або вирушайте у похід!");
                break;
        default:
            alert("На жаль, я не розумію такого настрою. Спробуйте ще раз");
}
